		--Создание файлов БД 
USE master
CREATE DATABASE [Ремонт фасадов]
	ON
	(NAME = 'Ремонт_фасадов',
	FILENAME = 'C:\Program Files\Microsoft SQL Server\MSSQL12.SQLEXPRESS\MSSQL\DATA\Ремонт_фасадов.mdf',
	SIZE = 5,
	MAXSIZE = 20,
	FILEGROWTH = 1)
LOG ON
	(NAME = 'Ремонт_Фасадов_log',
	FILENAME = 'C:\Program Files\Microsoft SQL Server\MSSQL12.SQLEXPRESS\MSSQL\DATA\Ремонт_фасадов_log.ldf',
	SIZE = 5,
	MAXSIZE = 10,
	FILEGROWTH = 1)
GO
	--Создание и заполнение таблиц 
USE [Ремонт фасадов]
GO 
CREATE TABLE Здание
	([№ здания] int not null identity (1, 1),
	Район varchar(30) not null,
	Адрес varchar(40) not null,
	Площадь_м2 float not null check(Площадь_м2 > 1),
	[Тип здания] varchar(16) not null check([Тип здания] in ('Торговое', 'Офисное', 'Жилое', 'Производственное', 'Общественное')))
GO
	ALTER TABLE Здание
		ADD CONSTRAINT PK_номер_здания primary key ([№ здания])
GO
CREATE TABLE Бригада
	([№ бригады] int not null identity (1, 1),
	Бригадир varchar(30) not null,
	[Контактный номер] varchar(18) not null check ([Контактный номер] like '+7([0-9][0-9][0-9]) [0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]'),
	[Количество рабочих] tinyint not null check([Количество рабочих] > 1)
	)
GO
	ALTER TABLE Бригада
		ADD CONSTRAINT PK_номер_бригады primary key ([№ бригады])
GO
CREATE TABLE Договор
	([№ договора] int not null identity (1, 1),
	[Дата заключения договора] date, 
	[Предполагаемые сроки работ] smallint not null check([Предполагаемые сроки работ] > 1),
	[Ориентировочная стоимость] money not null check([Ориентировочная стоимость] > 2000), 
	[ФИО заказчика] varchar(30) not null,
	[Номер Здания] int not null check([Номер Здания] >= 1),
	Бригада int not null check(Бригада >= 1)
	)
GO
	ALTER TABLE Договор
		ADD CONSTRAINT PK_номер_договора primary key ([№ договора])
GO
	ALTER TABLE Договор
		ADD CONSTRAINT FK_договор_здание foreign key
		([Номер здания]) references Здание([№ здания])
GO
	ALTER TABLE Договор
		ADD CONSTRAINT FK_договор_бригада foreign key
		(Бригада) references Бригада([№ бригады])
GO
CREATE TABLE Процесс
	(Договор int unique not null check(Договор >= 1),
	[Дата начала] date,
	[Дата окончания работ] date,
	[Фактическая стоимость] money default (2000))
GO
	ALTER TABLE Процесс
		ADD CONSTRAINT PK_договор primary key (Договор)
GO
	ALTER TABLE Процесс
		ADD CONSTRAINT FK_процесс_договор foreign key
		(Договор) references Договор([№ договора])
GO
DBCC CHECKIDENT('Здание', RESEED, 1)
GO
INSERT INTO Здание VALUES
	('Железнодорожный район', 'ул. Пушкина д.23', 100, 'Офисное'),
	('Московский район', 'ул. Вишневая д.21', 222, 'Жилое'),
	('Октябрьский район', 'ул. Шабулина зд.5', 50.5, 'Офисное'),
	('Железнодорожный район', 'ул. Пушкина д.19', 33.7, 'Офисное'),
	('Советский район', 'ул. Черновицкая строение 13', 145, 'Производственное'),
	('Московский район', 'Московское ш.21', 567.4, 'Торговое'),
	('Московский район', 'Московское ш., 5А', 348.2, 'Торговое'),
	('Московский район', 'ул. Ленина д.5', 123, 'Общественное'),
	('Октябрьский район', 'ул. Маркса строение 5', 76.5, 'Производственное'),
	('Железнодорожный район', 'ул. Есенина д.7 к.1', 60, 'Жилое'),
	('Советский район', 'ул. Кирова д.10', 58.3, 'Офисное'),
	('Октябрьский район', 'ул. Гагарина д.15', 180, 'Торговое'),
	('Московский район', 'ул. Победы д.30', 90.2, 'Офисное'),
	('Московский район', 'ул. Ленина д.55', 45.8, 'Жилое'),
	('Советский район', 'ул. Фрунзе д.25', 23.1, 'Производственное'),
	('Московский район', 'ул. Степанова д.12', 67, 'Торговое'),
	('Октябрьский район', 'ул. Толстого д.7', 35, 'Общественное'),
	('Московский район', 'ул. Калинина д.40', 89.5, 'Общественное'),
	('Советский район', 'ул. Лесная д.18', 55.2, 'Офисное'),
	('Железнодорожный район', 'ул. Красноармейская д.3', 200, 'Производственное')
GO
DBCC CHECKIDENT('Бригада', RESEED, 1)
INSERT INTO Бригада VALUES
	('Иванов И.Ф.', '+7(123) 456-78-90', 15),
	('Петров Ф.А.', '+7(234) 567-89-01', 12),
	('Сидоров А.А.', '+7(345) 678-90-12', 6),
	('Орлов С.П.', '+7(567) 890-12-34', 7),
	('Кузнецов О.О.', '+7(789) 012-34-56', 4),
	('Лебедев А.А.', '+7(012) 345-67-89', 8),
	('Козлов О.Е.', '+7(123) 456-78-90', 8),
	('Антонов А.М.', '+7(789) 012-34-56', 28),
	('Соколов П.М.', '+7(890) 123-45-67', 6),
	('Попов А.Е.', '+7(901) 234-56-78', 17),
	('Хомячков С.П.', '+7(904) 264-16-08', 9),
	('Шапоренко А.С.', '+7(900) 909-00-99', 30),
	('Калинин А.В.', '+7(123) 456-78-90', 20),
	('Волков В.Л.', '+7(234) 567-89-01', 18),
	('Григорьев И.В.', '+7(345) 678-90-12', 12),
	('Волков В.Л.', '+7(234) 567-89-01', 10)
GO
DBCC CHECKIDENT('Договор', RESEED, 1)
GO
INSERT INTO Договор VALUES
	('2023-07-10', 50, 500000, 'Скоз Е.Ю.', 1, 5),
	('2023-09-22', 189, 7376200, 'Иваков А.В.', 12, 6), 
	('2022-03-07', 96, 1030550, 'Сюсюкалов А.И.', 4, 2), 
	('2022-03-07', 63, 1549800, 'Семенов А.М.', 8, 9), 
	('2023-08-12', 71, 320000, 'Иваков А.В.', 6, 3), 
	('2023-05-11', 17, 156980, 'Хейленко М.А.', 5, 4), 
	('2023-05-11', 54, 450680, 'Потапов В.М.', 10, 11),
	('2021-03-01', 167, 3985000, 'Матвеев А.Ю.', 7, 8),
	('2023-01-29', 59, 452160, 'Матвеев А.Ю.', 9, 9),
	('2019-11-18', 42, 356210, 'Сергеева Т.А.', 5, 14),
	('2022-07-05', 86, 730000, 'Козлов И.В.', 20, 14),
	('2022-10-15', 33, 250000, 'Петрова О.Н.', 15, 13),
	('2021-05-28', 75, 890000, 'Кутузов Д.С.', 13, 11),
	('2019-11-11', 123, 1502000, 'Макаров П.А.', 12, 10),
	('2022-12-25', 10, 620560, 'Пеньков Н.М.', 11, 12),
	('2022-04-17', 89, 980000, 'Зайцев И.А.', 14, 8),
	('2021-09-09', 96, 1150000, 'Добров А.И.', 13, 11),
	('2023-03-08', 45, 150000, 'Печкин М.В.', 11, 8),
	('2020-06-23', 67, 220000, 'Астафьев А.В.', 3, 15),
	('2020-02-14', 11, 300000, 'Князев И.С.', 17, 10)
GO
INSERT INTO Процесс VALUES
	(1, '2023-07-15', '2023-09-10', 510000),
	(2, '2023-10-28', NULL, NULL),
	(3, '2022-03-17', '2022-07-03', 1030552),
	(4, '2022-03-17', '2022-07-03', 1549800),
	(5, '2023-09-11', NULL, NULL),
	(6, '2023-05-13', '2023-05-23', 225971),
	(7, '2023-05-14', '2023-06-28', 520685),
	(8, '2021-03-05', '2022-01-15', 3781000),
	(9, '2023-01-18', '2022-03-10', 480009),
	(10, '2019-01-20', '2019-02-27', 358869), 
	(11, '2022-07-05', '2022-09-19', 736110), 
	(12, '2022-10-20', '2022-11-18', 250000),
	(13, '2021-05-30', '2021-09-13', 900000),
	(14, '2019-11-15', '2020-03-17', 1502000),
	(15, '2022-12-27', '2022-01-06', 620560),
	(16, '2022-04-20', '2020-07-10', 1080000),
	(17, '2021-09-12', '2021-02-10', 1050000),
	(18, '2023-03-08', '2023-04-05', 200000),
	(19, '2020-06-23', '2020-09-23', 220000),
	(20, '2020-02-27', '2020-03-07', 300000)
GO